#! python3
# -*- coding: utf-8 -*-
print("Hello, Python3!")  # 使用print函数打印字符串

'''
多行注释示例
多行注释示例
多行注释示例
'''

# Python是一种解释型、面向对象、动态数据类型的高级程序设计语言。
# - 解释型
# - 强（Strongly）面向对象语言：在Python中所有的一切都是对象，包括数字、字符串与函数；
# - 动态数据类型
# - 高级程序设计语言
# Python3.x不能向下兼容。
# Python官网发布声明Python2.7将支持维护到2020年，编写新的Python程序建议使用Python3.x。

# ### 注意
# - Python区分大小写；
#
# ### 获取帮助
# - 使用内置的help()命令获得Python中有关任何函数或语句的帮助信息；
# - 例如，运行help('print')命令显示出有关print语句的帮助；
#
# ### 指定文件编码为utf-8
# - # -*- coding: utf-8 -*-
# - 如果没有编码类型的声明，默认以ASCII编码处理
# - 必须放在python文件开头部分（第一行或第二行）
#
# ### 注释
# - Python单行注释以#开头，任何存在于“#”号右侧的字符都被认为注释内容；
# - 多行注释可以用三个单引号'''或三个双引号"""将需要注释的部分括起来;
# - 注释是代码的解释说明；
# - 必要的合理注释将极大有助于代码开发和维护，例如：解释重要的细节和节点、表明已解决和将要面对的问题，等等；
#
# ### 执行Python代码的两种方式
# 1.交互式编程。直接在python命令行中执行语句。终端中输入python3进入命令行模式，输入exit()回车或者CTRL+D退出命令行模式。
# 2.脚本式编程。将需要执行的代码写入以.py结尾的python文件，用“python3 filename”命令执行。
