# -*- coding: utf-8 -*-

print("Hello, Python3!")  # 使用print函数打印字符串
print("你好，Python3！")

'''
多行注释示例
多行注释示例
多行注释示例
'''

# ### Python
# Python是一种解释型、面向对象、动态数据类型的高级程序设计语言；
# - 解释型：相对于编译型语言存在的，源代码不是直接翻译成机器语言，而是先翻译成中间代码，再由解释器对中间代码进行解释运行；
# - 强面向对象语言：在Python中所有的一切都是对象，包括数字、字符串与函数；
# - 动态数据类型：变量本身类型不固定，定义变量时也不需要指定类型（编译时编译器并不知道变量的真实类型, 只有在运行时才知道其真实类型）；
# - 高级程序设计语言：良好的可移植性（不依赖于具体的机器）、丰富的数据结构和控制结构、良好的可读性（便于交流和维护）；
#
# ### 特别注意
# - Python区分大小写；
# - Python3.x不能向下兼容Python2.x（官网声明Python2.7将支持维护到2020年，编写新的Python程序建议使用Python3.x）；
#
# ### 字符编码
# UTF-8编码格式支持中文，可以通过“# -*- coding: utf-8 -*-”或“# coding=utf-8”在文件开头显式指定；
#
# ### 注释
# 注释是代码的解释说明；
# 必要的合理注释将极大有助于代码开发和维护，例如：解释重要的细节和节点、表明已解决和将要面对的问题，等等；
# - 单行注释：以“#”开头，任何存在于“#”号右侧的字符都被认为注释内容；
# - 多行注释：使用三个单引号'''或三个双引号"""将需要注释的部分括起来;
